web-training-backend/tests/stress/load-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 100
      name: "Sustained load"
    - duration: 60
      arrivalRate: 200
      name: "Spike test"
  payload:
    path: './test-data.csv'
    fields:
      - name
      - email
      - password
  plugins:
    expect: {}
  
scenarios:
  - name: "API Health Check"
    weight: 10
    flow:
      - get:
          url: "/api/v1/health"
          expect:
            - statusCode: 200
            - hasProperty: "success"
            - equals:
                - "{{ success }}"
                - true

  - name: "User Registration and Login Flow"
    weight: 40
    flow:
      - post:
          url: "/api/v1/auth/register"
          json:
            name: "{{ name }}"
            email: "test-{{ $randomString() }}@example.com"
            password: "TestPass123!"
            confirmPassword: "TestPass123!"
          capture:
            - json: "$.token"
              as: "authToken"
            - json: "$.user.id"
              as: "userId"
          expect:
            - statusCode: 201
            - hasProperty: "token"
      
      - get:
          url: "/api/v1/auth/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
            - hasProperty: "data"

  - name: "Module Browsing"
    weight: 30
    flow:
      - get:
          url: "/api/v1/modules"
          expect:
            - statusCode: 200
            - hasProperty: "data"
      
      - get:
          url: "/api/v1/modules?category=Web Security"
          expect:
            - statusCode: 200
            - hasProperty: "data"
      
      - get:
          url: "/api/v1/modules?search=security"
          expect:
            - statusCode: 200
            - hasProperty: "data"

  - name: "Authentication Flow"
    weight: 20
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "admin@vibesafe.com"
            password: "AdminPass123!"
          capture:
            - json: "$.token"
              as: "adminToken"
          expect:
            - statusCode: 200
            - hasProperty: "token"
      
      - get:
          url: "/api/v1/auth/me"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200
            - hasProperty: "data"
      
      - get:
          url: "/api/v1/auth/logout"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200